import { TProjectItem } from "../pages/projects/projects";

export const colors = [
  "#545dad",
  "#FD7B38",
  "#2EB67D",
  "#E257B3",
  "#A384DB",
  "#7ED3E9",
];

export const data: TProjectItem[] = [
  {
    id: 1,
    name: "Lorem Ipsum",
    description:
      "Lorem Ipsum является стандартной 'рыбой' для текстов на латинице с начала XVI века. В то время некий безымянный печатник создал большую коллекцию размеров и форм шрифтов, используя Lorem Ipsum для распечатки образцов.",
    count: 84,
    done: 45,
  },
  {
    id: 2,
    name: "Дизайн и композиция",
    description:
      "Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться.",
    count: 21,
    done: 4,
  },
  {
    id: 3,
    name: "Набор слов",
    description:
      "Многие думают, что Lorem Ipsum - взятый с потолка псевдо-латинский набор слов, но это не совсем так.",
    count: 15,
    done: 12,
  },
  {
    id: 4,
    name: "Юмористические вставки или слова",
    description:
      "Есть много вариантов Lorem Ipsum, но большинство из них имеет не всегда приемлемые модификации, например, юмористические вставки или слова, которые даже отдалённо не напоминают латынь.",
    count: 8,
    done: 2,
  },
  {
    id: 5,
    name: "Композиция",
    description:
      "Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться.",
    count: 21,
    done: 4,
  },
  {
    id: 6,
    name: "Слова",
    description:
      "Многие думают, что Lorem Ipsum - взятый с потолка псевдо-латинский набор слов, но это не совсем так.",
    count: 15,
    done: 12,
  },
  {
    id: 7,
    name: "Вставки",
    description:
      "Есть много вариантов Lorem Ipsum, но большинство из них имеет не всегда приемлемые модификации, например, юмористические вставки или слова, которые даже отдалённо не напоминают латынь.",
    count: 8,
    done: 2,
  },
];
